In [2]:
import pandas as pd
import fastparquet as fp

Producto

In [3]:
df_producto= pd.read_parquet('/henry/PF/Datasets relevamiento precios/producto.parquet')

In [4]:
df_producto.shape

(72038, 7)

In [5]:
df_producto.head()

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,0000000001663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,None,None,None
1,0000000002288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,None,None,None
2,0000000205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,None,None,None
3,0000000205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,None,None,None
4,0000000205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,None,None,None

In [6]:
df_producto.drop(columns=['categoria1','categoria2','categoria3'],inplace=True)

In [7]:
df_producto.fillna(0 ,inplace=True)

In [8]:
df_producto=df_producto.astype({'id':'string'})

In [9]:
def normalizar_id_producto(id):
    if type(id)!=str:
        return id
    
    cantidad_caracter=len(id)
    if len(id)<13:
        id= '0'*(13-cantidad_caracter)+id
    
    if '-' in id:
        id=id[id.rfind('-')+1: cantidad_caracter]
    
    if '.' in id:
        id = id[0 :id.find('.')]
    return id

In [ ]:
2148.0
21647+ESDA

In [10]:
normalizar_id_producto(df_producto.id)

0        0000000001663
1        0000000002288
2        0000000205870
3        0000000205894
4        0000000205955
             ...
72033    9569753142128
72034    9795403001143
72035    9990385651922
72036    9990385651939
72037    9990385651946
Name: id, Length: 72038, dtype: string

In [11]:
df_producto.reindex(columns= ['id','marca','nombre','presentacion'])

,id,marca,nombre,presentacion
0,0000000001663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un
1,0000000002288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un
2,0000000205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg
3,0000000205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg
4,0000000205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg
...,...,...,...,...
72033,9569753142128,DELI-SITAS,Milhojas Cobertura de Chocolate Blanco Deli-Si...,500.0 gr
72034,9795403001143,MAYO,Mini Pizzetas Mayo 12 Un,12.0 un
72035,9990385651922,DANA,Te Negro en Hebras Lata Dana 50 Gr,50.0 gr
72036,9990385651939,DANA,Te Verde en Hebras Lata Dana 50 Gr,50.0 gr
72037,9990385651946,DANA,Yerba Mate Aromatizada Lata Dana 150 Gr,150.0 gr

In [58]:
df_producto.to_csv('producto.csv',index=False)

Sucursal

In [13]:
df_sucursal= pd.read_csv('/henry/PF/Datasets relevamiento precios/sucursal.csv')

In [14]:
df_sucursal.head()

,id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
0,1-1-7,1,1,Super MAMI,Dinosaurio S.A.,AR-X,SALSIPUEDES,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

In [15]:
df_sucursal.shape

(2333, 12)

precios_semana_20200503

In [16]:
df_precios_semana_20200503=pd.read_json('/henry/PF/Datasets relevamiento precios/precios_semana_20200503.json')
df_precios_semana_20200503.to_csv('precios_semana_20200503.csv',index=False)

In [34]:
df_precios_semana_20200503.head()

   precio    producto_id sucursal_id
0    29.9  0000000002288     2-1-187
1    39.9  0000000002288     2-3-247
2  499.99  0000000205870     9-1-685
3  539.99  0000000205870      9-2-22
4  519.99  0000000205870      9-2-59

precios_semana_20200413

In [18]:
df_precios_semana_20200413=pd.read_csv('/henry/PF/Datasets relevamiento precios/precios_semana_20200413.csv',encoding='utf-16')
df_precios_semana_20200413.fillna(0)
df_precios_semana_20200413.to_csv('precios_semana_20200413.csv',index=False)

In [19]:
df_precios_semana_20200413.head()

   precio    producto_id sucursal_id
0   29.90  0000000001663     2-1-014
1   29.90  0000000002288     2-1-032
2   39.90  0000000002288     2-1-096
3  499.99  0000000205870     9-1-686
4  519.99  0000000205870     9-2-248

precios_semana_20200518

In [20]:
df_precios_semana_20200518=pd.read_csv('/henry/PF/Datasets relevamiento precios/precios_semana_20200518.txt', delimiter='|')
df_precios_semana_20200518.to_csv('precios_semana_20200518.csv',index=False)

In [21]:
df_precios_semana_20200518.head()

   precio    producto_id sucursal_id
0   29.90  0000000002288     2-1-009
1   32.90  0000000002288     2-1-037
2   36.90  0000000002288     2-1-090
3   39.90  0000000002288     2-3-247
4  499.99  0000000205870     9-1-430

precios_semanas_20200419_20200426

In [22]:
df_precios_semanas_20200419_20200426=pd.read_excel('/henry/PF/Datasets relevamiento precios/precios_semanas_20200419_20200426.xlsx')
df_precios_semanas_20200419_20200426.head()

    precio sucursal_id  producto_id
0    399.0     2-1-092       2288.0
1    299.0     2-1-206       2288.0
2    399.0     2-2-241       2288.0
3  49999.0     9-1-430     205870.0
4  53999.0       9-2-4     205870.0

In [23]:
df_precios_semanas_20200419_20200426.fillna(0 ,inplace=True)
df_precios_semanas_20200419_20200426.head()

    precio sucursal_id  producto_id
0    399.0     2-1-092       2288.0
1    299.0     2-1-206       2288.0
2    399.0     2-2-241       2288.0
3  49999.0     9-1-430     205870.0
4  53999.0       9-2-4     205870.0

In [24]:
df_precios_semanas_20200419_20200426.reindex(columns= ['precio','producto_id','sucursal_id'])

         precio   producto_id sucursal_id
0         399.0  2.288000e+03     2-1-092
1         299.0  2.288000e+03     2-1-206
2         399.0  2.288000e+03     2-2-241
3       49999.0  2.058700e+05     9-1-430
4       53999.0  2.058700e+05       9-2-4
...         ...           ...         ...
478904  13999.0  9.569753e+12      25-1-1
478905   3499.0  9.795403e+12      25-1-1
478906   3125.0  9.990386e+12       5-1-3
478907   3125.0  9.990386e+12       5-1-3
478908   1989.0  9.990386e+12       5-1-3

[478909 rows x 3 columns]

In [25]:
df_precios_semanas_20200419_20200426.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478909 entries, 0 to 478908
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       478909 non-null  float64
 1   sucursal_id  478909 non-null  object
 2   producto_id  478909 non-null  float64
dtypes: float64(2), object(1)
memory usage: 11.0+ MB

In [26]:
df_precios_semanas_20200419_20200426=df_precios_semanas_20200419_20200426.astype({'producto_id':'string'})

In [27]:
df_precios_semanas_20200419_20200426.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478909 entries, 0 to 478908
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       478909 non-null  float64
 1   sucursal_id  478909 non-null  object
 2   producto_id  478909 non-null  string
dtypes: float64(1), object(1), string(1)
memory usage: 11.0+ MB

In [28]:
df_precios_semanas_20200419_20200426.producto_id

0                  2288.0
1                  2288.0
2                  2288.0
3                205870.0
4                205870.0
               ...
478904    9569753142128.0
478905    9795403001143.0
478906    9990385651922.0
478907    9990385651939.0
478908    9990385651946.0
Name: producto_id, Length: 478909, dtype: string

In [29]:
normalizar_id_producto(df_precios_semanas_20200419_20200426.producto_id)

0                  2288.0
1                  2288.0
2                  2288.0
3                205870.0
4                205870.0
               ...
478904    9569753142128.0
478905    9795403001143.0
478906    9990385651922.0
478907    9990385651939.0
478908    9990385651946.0
Name: producto_id, Length: 478909, dtype: string

In [30]:
df_precios_semanas_20200419_20200426.producto_id=(df_precios_semanas_20200419_20200426.producto_id).str.replace('.0','')
df_precios_semanas_20200419_20200426.producto_id=(df_precios_semanas_20200419_20200426.producto_id).str.zfill(13)

C:\Users\juseb\AppData\Local\Temp\ipykernel_72\790144264.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df_precios_semanas_20200419_20200426.producto_id=(df_precios_semanas_20200419_20200426.producto_id).str.replace('.0','')

In [31]:
df_precios_semanas_20200419_20200426.head()

    precio sucursal_id    producto_id
0    399.0     2-1-092  0000000002288
1    299.0     2-1-206  0000000002288
2    399.0     2-2-241  0000000002288
3  49999.0     9-1-430  0000000000058
4  53999.0       9-2-4  0000000000058

In [32]:
df_precios_semanas_20200419_20200426.to_csv('precios_semanas_20200419_20200426.csv',index=False)

Tabla Precios General

In [53]:
df_precios=pd.concat([df_precios_semana_20200413,df_precios_semana_20200503,df_precios_semana_20200518,df_precios_semanas_20200419_20200426])
df_precios.to_csv('precios.csv',index=False)